In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.simplefilter('ignore')
%matplotlib inline

In [2]:
uber_april = pd.read_csv('../Widhya/Uber-dataset/uber-raw-data-apr14.csv')
uber_may = pd.read_csv('../Widhya/Uber-dataset/uber-raw-data-may14.csv')
uber_june = pd.read_csv('../Widhya/Uber-dataset/uber-raw-data-jun14.csv')
uber_july = pd.read_csv('../Widhya/Uber-dataset/uber-raw-data-jul14.csv')
uber_august = pd.read_csv('../Widhya/Uber-dataset/uber-raw-data-aug14.csv')
uber_september = pd.read_csv('../Widhya/Uber-dataset/uber-raw-data-sep14.csv')

In [3]:
print(uber_april.shape)
print(uber_may.shape)
print(uber_june.shape)
print(uber_july.shape)
print(uber_august.shape)
print(uber_september.shape)

(564516, 4)
(652435, 4)
(663844, 4)
(796121, 4)
(829275, 4)
(1028136, 4)

In [4]:
uber_df = pd.concat([uber_april,uber_may,uber_june,uber_july,uber_august,uber_september],axis=0)

In [5]:
uber_df.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [6]:
print(uber_df.shape)

(4534327, 4)

In [7]:
uber_df['Date'] = pd.to_datetime(uber_df['Date/Time'])
uber_df['Month'] = pd.to_datetime(uber_df['Date/Time']).dt.month
uber_df['OnlyDate'] = pd.to_datetime(uber_df['Date/Time']).dt.date
uber_df['DayOfTheWeek'] = pd.to_datetime(uber_df['Date/Time']).dt.dayofweek
uber_df['Hour'] = pd.to_datetime(uber_df['Date/Time']).dt.hour

In [8]:
uber_df.head()

,Date/Time,Lat,Lon,Base,Date,Month,OnlyDate,DayOfTheWeek,Hour
0,4/1/2014 0:11:00,40.7690,-73.9549,B02512,2014-04-01 00:11:00,4,2014-04-01,1,0
1,4/1/2014 0:17:00,40.7267,-74.0345,B02512,2014-04-01 00:17:00,4,2014-04-01,1,0
2,4/1/2014 0:21:00,40.7316,-73.9873,B02512,2014-04-01 00:21:00,4,2014-04-01,1,0
3,4/1/2014 0:28:00,40.7588,-73.9776,B02512,2014-04-01 00:28:00,4,2014-04-01,1,0
4,4/1/2014 0:33:00,40.7594,-73.9722,B02512,2014-04-01 00:33:00,4,2014-04-01,1,0

In [14]:
uber_df.drop(['Lat','Lon','Date/Time'],axis=1,inplace=True)

In [15]:
uber_df.head()

     Base                Date  Month    OnlyDate  DayOfTheWeek  Hour
0  B02512 2014-04-01 00:11:00      4  2014-04-01             1     0
1  B02512 2014-04-01 00:17:00      4  2014-04-01             1     0
2  B02512 2014-04-01 00:21:00      4  2014-04-01             1     0
3  B02512 2014-04-01 00:28:00      4  2014-04-01             1     0
4  B02512 2014-04-01 00:33:00      4  2014-04-01             1     0

In [41]:
uber_df.set_index('Date',inplace=True)

In [42]:
uber_df.head()

                       Base  Month    OnlyDate  DayOfTheWeek  Hour
Date
2014-04-01 00:11:00  B02512      4  2014-04-01             1     0
2014-04-01 00:17:00  B02512      4  2014-04-01             1     0
2014-04-01 00:21:00  B02512      4  2014-04-01             1     0
2014-04-01 00:28:00  B02512      4  2014-04-01             1     0
2014-04-01 00:33:00  B02512      4  2014-04-01             1     0

In [43]:
timeseries_df = uber_df.resample('D').mean()

In [44]:
timeseries_df.head()

            Month  DayOfTheWeek       Hour
Date
2014-04-01    4.0           1.0  13.940946
2014-04-02    4.0           2.0  14.088818
2014-04-03    4.0           3.0  15.214337
2014-04-04    4.0           4.0  15.216141
2014-04-05    4.0           5.0  15.728856

In [45]:
print(timeseries_df.shape)

(183, 3)

In [46]:
ann_df = uber_df.resample('H').mean()

In [47]:
ann_df.head()

                     Month  DayOfTheWeek  Hour
Date
2014-04-01 00:00:00      4             1     0
2014-04-01 01:00:00      4             1     1
2014-04-01 02:00:00      4             1     2
2014-04-01 03:00:00      4             1     3
2014-04-01 04:00:00      4             1     4

In [48]:
ann_df.shape

(4391, 3)